InformationRegisters/НастройкиВыплатПоДоговорамОпеки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НастройкиВыплатПоДоговорамОпеки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьВыплатыПоДоговорамОпеки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьВозрастРебенкаПриВыплатахПоДоговорамОпеки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиВыплатПоДоговорамОпеки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьНастройки(НастройкиВыплатПоДоговорамОпеки) Экспорт
	
	Настройки = РегистрыСведений.НастройкиВыплатПоДоговорамОпеки.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Настройки, НастройкиВыплатПоДоговорамОпеки);
	Настройки.Записать();
	
КонецПроцедуры

Функция ЗначенияНастроек() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(НастройкиВыплатПоДоговорамОпеки.ИспользоватьВыплатыПоДоговорамОпеки, ЛОЖЬ) КАК ИспользоватьВыплатыПоДоговорамОпеки,
		|	ЕСТЬNULL(НастройкиВыплатПоДоговорамОпеки.УчитыватьВозрастРебенкаПриВыплатахПоДоговорамОпеки, ЛОЖЬ) КАК УчитыватьВозрастРебенкаПриВыплатахПоДоговорамОпеки
		|ИЗ
		|	РегистрСведений.НастройкиВыплатПоДоговорамОпеки КАК НастройкиВыплатПоДоговорамОпеки";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат РегистрыСведений.НастройкиВыплатПоДоговорамОпеки.СоздатьМенеджерЗаписи();
	Иначе
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
